Repository: minerva-university/rationapp
Catalog: lib/l10n/intl_*.arb
Languages: ar, es

source: Please fill in all fields before viewing requirements.
ar: يرجى ملء جميع الحقول قبل عرض المتطلبات.
es: Por favor, complete todos los campos antes de ver los requisitos.

source: Cow Characteristics
ar: خصائص البقرة
es: Características de la Vaca

source: Milk Yield
ar: إنتاج الحليب
es: Producción de Leche

source: View Cow requirements
ar: عرض متطلبات البقرة
es: Ver Requisitos de la Vaca

source: Feed Formula
ar: تركيبة العلف
es: Fórmula de Alimentación

source: Add Fodder
ar: إضافة علف
es: Agregar Forraje

source: Add Concentrate
ar: إضافة مركز
es: Agregar Concentrado

source: Concentrate
ar: مركز
es: Concentrado

source: Totals
ar: المجاميع
es: Totales

source: Fodder
ar: علف
es: Forraje

source: Cow Requirements
ar: متطلبات البقرة
es: Requisitos de la Vaca

# allOptionsHaveBeenAdded
source: All {type} options have been added.
ar: تم إضافة جميع خيارات {type}.
es: Se han agregado todas las opciones de {type}.

source: Feeding Guidelines
ar: إرشادات التغذية
es: Pautas de Alimentación

# kgValue
source: {value} kg
ar: {value} كغم

# kgPerDay
source: {value} kg/day
ar: {value} كغم/يوم
es: {value} kg/día

# mjPerDayValue
source: {value} MJ/day
ar: {value} ميغاجول/يوم
es: {value} MJ/día

# dryMatterIntakeLabel
source: Dry Matter Intake
ar: استهلاك المادة الجافة
es: Ingesta de Materia Seca

# meIntakeLabel
source: ME Intake
ar: استهلاك الطاقة المستقلبة
es: Ingesta de EM

# crudeProteinLabel
source: Crude Protein
ar: البروتين الخام
es: Proteína Cruda

# ndfLabel
source: NDF
ar: الألياف المحايدة
es: FDN

# caIntakeLabel
source: Ca Intake
ar: استهلاك الكالسيوم
es: Ingesta de Ca

# pIntakeLabel
source: P Intake
ar: استهلاك الفوسفور
es: Ingesta de P

source: Period
ar: الفترة
es: Período

source: Early Lactation Feeding
ar: تغذية مرحلة الإدرار المبكرة
es: Alimentación en Lactancia Temprana

# earlyLactationPeriod
source: Early Lactation (14-100 days)
ar: مرحلة الإدرار المبكرة (14-100 يوم)
es: Lactancia Temprana (14-100 días)

source: Mid Lactation Feeding
ar: تغذية مرحلة الإدرار المتوسطة
es: Alimentación en Lactancia Media

# midLactationPeriod
source: Mid lactation (100 to 200 days)
ar: مرحلة الإدرار المتوسطة (100 إلى 200 يوم)
es: Lactancia Media (100 a 200 días)

source: Late Lactation Feeding
ar: تغذية مرحلة الإدرار المتأخرة
es: Alimentación en Lactancia Tardía

# lateLactationPeriod
source: Late Lactation (>200 days)
ar: مرحلة الإدرار المتأخرة (أكثر من 200 يوم)
es: Lactancia Tardía (>200 días)

source: Dry Cow Feeding
ar: تغذية البقرة الجافة
es: Alimentación de Vaca Seca

# dryCowPeriod
source: Due to calve in 45 to 60 days
ar: على وشك الولادة خلال 45 إلى 60 يوم
es: A parir en 45 a 60 días

source: Plan feed
ar: تخطيط التغذية
es: Planificar alimentación

# dmIntakeLabel
source: DM Intake
ar: استهلاك المادة الجافة
es: Ingesta de MS

# cpIntakeLabel
source: CP Intake
ar: استهلاك البروتين الخام
es: Ingesta de PC

# ndfIntakeLabel
source: NDF Intake
ar: استهلاك الألياف المحايدة
es: Ingesta de FDN

# concentrateIntakeLabel
source: Concentrate Intake
ar: استهلاك المركزات
es: Ingesta de Concentrado

source: Select Ration Ingredient
ar: اختر مكون الحصة الغذائية
es: Seleccionar Ingrediente de Ración

# freshFeedIntake
source: Fresh feed intake (kg/d)
ar: استهلاك العلف الطازج (كغم/يوم)
es: Ingesta de alimento fresco (kg/día)

source: Cancel
ar: إلغاء
es: Cancelar

source: Add
ar: إضافة
es: Agregar

source: Choose fodder
ar: اختر العلف
es: Elegir forraje

source: Choose concentrate
ar: اختر المركز
es: Elegir concentrado

# pleaseAllFields
source: Please fill in all fields.
ar: يرجى ملء جميع الحقول.
es: Por favor, complete todos los campos.

# dmIntakeLabelWithUnit
source: DM Intake (kg/day)
ar: استهلاك المادة الجافة (كغم/يوم)
es: Ingesta de MS (kg/día)

# meIntakeLabelWithUnit
source: ME Intake (MJ/day)
ar: استهلاك الطاقة المستقلبة (ميغاجول/يوم)
es: Ingesta de EM (MJ/día)

# cpIntakeLabelWithUnit
source: CP Intake (%)
ar: استهلاك البروتين الخام (%)
es: Ingesta de PC (%)

# ndfIntakeLabelWithUnit
source: NDF Intake (%)
ar: استهلاك الألياف المحايدة (%)
es: Ingesta de FDN (%)

# caIntakeLabelWithUnit
source: Ca Intake (%)
ar: استهلاك الكالسيوم (%)
es: Ingesta de Ca (%)

# pIntakeLabelWithUnit
source: P Intake (%)
ar: استهلاك الفوسفور (%)
es: Ingesta de P (%)

# concentrateIntakeLabelWithUnit
source: Concentrate Intake (%)
ar: استهلاك المركزات (%)
es: Ingesta de Concentrado (%)

# liveWeight
source: Live weight (kg)
ar: الوزن الحي (كغم)
es: Peso vivo (kg)

# pregnancy
source: Pregnancy (mth)
ar: الحمل (شهر)
es: Gestación (meses)

# milkVolumePerDay
source: Milk volume per day (kg)
ar: كمية الحليب يومياً (كغم)
es: Volumen de leche por día (kg)

source: Milk fat (%)
ar: دهون الحليب (%)
es: Grasa de la leche (%)

source: Milk protein (%)
ar: بروتين الحليب (%)
es: Proteína de la leche (%)

source: Lactation stage
ar: مرحلة الإدرار
es: Etapa de lactancia

# ingredientLabel
source: Ingredient
ar: المكون
es: Ingrediente

# freshFeedIntakeLabel
source: Fresh feed intake (kg/d)
ar: استهلاك العلف الطازج (كغم/يوم)
es: Ingesta de alimento fresco (kg/día)

# cpIntakeLabelKgPerD
source: CP Intake (kg/d)
ar: استهلاك البروتين الخام (كغم/يوم)
es: Ingesta de PC (kg/día)

# ndfIntakeLabelKgPerD
source: NDF Intake (kg/d)
ar: استهلاك الألياف المحايدة (كغم/يوم)
es: Ingesta de FDN (kg/día)

# caIntakeLabelKgPerD
source: Ca Intake (kg/d)
ar: استهلاك الكالسيوم (كغم/يوم)
es: Ingesta de Ca (kg/día)

# pIntakeLabelKgPerD
source: P Intake (kg/d)
ar: استهلاك الفوسفور (كغم/يوم)
es: Ingesta de P (kg/día)

# costLabel
source: Cost (ERN)
ar: التكلفة (ERN)
es: Costo (ERN)

# lactationStageDry
source: Dry
ar: جافة
es: Seca

# lactationStageEarlyLactation
source: Early lactation
ar: مرحلة الإدرار المبكرة
es: Lactancia temprana

# lactationStageMidLactation
source: Mid lactation
ar: مرحلة الإدرار المتوسطة
es: Lactancia media

# lactationStageLateLactation
source: Late lactation
ar: مرحلة الإدرار المتأخرة
es: Lactancia tardía

# concentrateSesameSeedMeal
source: sesame seed meal
ar: وجبة بذور السمسم
es: Harina de semillas de sésamo

# concentrateMolasses
source: Molasses
ar: دبس السكر
es: Melaza

# concentrateMaizeGrain
source: Maize grain
ar: حبوب الذرة
es: Grano de maíz

# concentrateSoybeanCake
source: Soybean cake
ar: كعكة فول الصويا
es: Torta de soja

# concentrateWheatBran
source: Wheat bran
ar: نخالة القمح

# concentrateSorghumGrain
source: Sorghum grain
ar: حبوب الذرة الرفيعة

# concentratePearlMilletGrain
source: Pearl millet grain
ar: حبوب الدخن اللؤلؤي

# concentrateGroundnutMeal
source: Groundnut meal
ar: وجبة الفول السوداني

# concentrateChickpeaMeal
source: Chickpea meal
ar: وجبة الحمص

# concentrateMaizeBran
source: Maize bran
ar: نخالة الذرة

# concentrateWheatGrain
source: Wheat grain
ar: حبوب القمح

# concentrateSoybeanMeal
source: Soybean meal
ar: وجبة فول الصويا

# concentrateSoybeanHulls
source: Soybean hulls
ar: قشور فول الصويا

# concentrateSoybeanOil
source: Soybean oil
ar: زيت فول الصويا

# concentrateBrewersByProductFresh
source: Brewers by-product fresh
ar: منتجات البيرة الثانوية الطازجة

# concentrateMineralLick
source: Mineral lick
ar: ملعقة المعادن

# concentrateDryBread
source: Dry bread
ar: خبز جاف

# concentrateSorghumBrewersGrainFresh
source: Sorghum brewers grain fresh
ar: حبوب الذرة الرفيعة من منتجات البيرة الطازجة

# concentrateSalt
source: Salt
ar: ملح

# fodderGreenMaizeForage
source: Green maize forage
ar: علف الذرة الخضراء
es: Forraje de maíz verde

# fodderAlfafa
source: Alfafa
ar: البرسيم
es: Alfalfa

# fodderBananaStalks
source: Banana stalks
ar: سيقان الموز

# fodderBananaLeaves
source: Banana leaves
ar: أوراق الموز
es: Hojas de plátano

# fodderSorghumForage
source: Sorghum forage
ar: علف الذرة الرفيعة
es: Forraje de sorgo

# fodderSorghumStalk
source: Sorghum stalk
ar: سيقان الذرة الرفيعة

# fodderMaizeSilage
source: Maize silage
ar: سيلاج الذرة
es: Ensilaje de maíz

# fodderSorghumBiProductResidue
source: Sorghum bi-product residue
ar: بقايا منتجات الذرة الرفيعة الثانوية

# fodderPearlMilletStalk
source: Pearl millet stalk
ar: سيقان الدخن اللؤلؤي

# fodderPearlMilletFreshForage
source: Pearl millet fresh forage
ar: علف الدخن اللؤلؤي الطازج

# fodderWheatStraw
source: Wheat straw
ar: قش القمح

# fodderBarleyStraw
source: Barley straw
ar: قش الشعير

# fodderCabbage
source: Cabbage
ar: ملفوف

# fodderElephantGrass
source: Elephant grass
ar: عشب الفيل

# fodderEragrostisTefHay
source: Eragrostis tef hay
ar: قش التف

# fodderBananaFruit
source: Banana fruit
ar: ثمار الموز

# fodderWildGrassFresh
source: Wild grass fresh
ar: العشب البري الطازج

# fodderWildGrassHay
source: Wild grass hay
ar: قش العشب البري

# fodderElephantGrassHay
source: Elephant grass hay
ar: قش عشب الفيل
es: Heno de pasto elefante

# fodderBarleyHay
source: Barley hay
ar: قش الشعير

# fodderWheatHay
source: Wheat hay
ar: قش القمح

source: Choose live weight (kg)
ar: اختر الوزن الحي (كغم)
es: Elegir peso vivo (kg)

source: Choose pregnancy month
ar: اختر شهر الحمل
es: Elegir mes de embarazo

source: Choose milk fat %
ar: اختر نسبة دهون الحليب %
es: Elegir % de grasa en leche

source: Choose milk protein %
ar: اختر نسبة بروتين الحليب %
es: Elegir % de proteína en leche

source: Choose lactation stage
ar: اختر مرحلة الإدرار
es: Elegir etapa de lactancia

source: Choose
ar: اختر
es: Elegir

source: Prices
ar: الأسعار
es: Precios

# costPerKg
source: Cost/kg
ar: التكلفة/كغم
es: Costo/kg

source: Feed Prices and Availability
ar: أسعار الأعلاف وتوفرها
es: Precios de alimentos y disponibilidad
